; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_2 ?v3 - type_3 ?v1 - type_1)
 	      (pred_3 ?v5 - object ?v1 - type_1)
	      (pred_4 ?v3 - type_3 ?v8 - type_2)
	      (pred_1 ?v3 - type_3 ?v5 - object ?v8 - type_2))

   (:action op_3
       :parameters  (?v3 - type_3 ?v7 ?v2 - type_1)
       :precondition (and  (pred_2 ?v3 ?v7))
       :effect (and  (pred_2 ?v3 ?v2)
		     (not (pred_2 ?v3 ?v7))))

   (:action op_1
       :parameters (?v3 - type_3 ?v6 - object ?v4 - type_1 ?v8 - type_2)
       :precondition  (and  (pred_3 ?v6 ?v4) (pred_2 ?v3 ?v4) (pred_4 ?v3 ?v8))
       :effect (and (pred_1 ?v3 ?v6 ?v8)
		    (not (pred_3 ?v6 ?v4)) 
		    (not (pred_4 ?v3 ?v8))))

   (:action op_2
       :parameters (?v3 - type_3 ?v6 - object ?v4 - type_1 ?v8 - type_2)
       :precondition  (and  (pred_1 ?v3 ?v6 ?v8) (pred_2 ?v3 ?v4))
       :effect (and (pred_3 ?v6 ?v4)
		    (pred_4 ?v3 ?v8)
		    (not (pred_1 ?v3 ?v6 ?v8)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_07 obj_09 - type_3
obj_11 obj_01 obj_12 obj_03 - type_2
obj_06 obj_04 obj_13 obj_10 - type_1
obj_08 obj_02 obj_05 - object)
(:init
(pred_2 obj_07 obj_10)
(pred_4 obj_07 obj_11)
(pred_4 obj_07 obj_01)
(pred_2 obj_09 obj_13)
(pred_4 obj_09 obj_12)
(pred_4 obj_09 obj_03)
(pred_3 obj_08 obj_04)
(pred_3 obj_02 obj_10)
(pred_3 obj_05 obj_04)
)
(:goal
(and
(pred_3 obj_08 obj_10)
(pred_3 obj_02 obj_10)
(pred_3 obj_05 obj_13)
)
)

(:constraints
  (always (not (pred_2 obj_07 obj_13)))
)
)

; plan
1. (op_3 obj_07 obj_10 obj_04)
   deleted: (pred_2 obj_07 obj_10)
   added: (pred_2 obj_07 obj_04)
   goals met: 1 of 3
2. (op_3 obj_09 obj_13 obj_04)
   deleted: (pred_2 obj_09 obj_13)
   added: (pred_2 obj_09 obj_04)
   goals met: 1 of 3
3. (op_1 obj_07 obj_08 obj_04 obj_01)
   deleted: (pred_3 obj_08 obj_04) (pred_4 obj_07 obj_01)
   added: (pred_1 obj_07 obj_08 obj_01)
   goals met: 1 of 3
4. (op_1 obj_09 obj_05 obj_04 obj_03)
   deleted: (pred_3 obj_05 obj_04) (pred_4 obj_09 obj_03)
   added: (pred_1 obj_09 obj_05 obj_03)
   goals met: 1 of 3
5. (op_3 obj_07 obj_04 obj_10)
   deleted: (pred_2 obj_07 obj_04)
   added: (pred_2 obj_07 obj_10)
   goals met: 1 of 3
6. (op_3 obj_09 obj_04 obj_13)
   deleted: (pred_2 obj_09 obj_04)
   added: (pred_2 obj_09 obj_13)
   goals met: 1 of 3
7. (op_2 obj_07 obj_08 obj_10 obj_01)
   deleted: (pred_1 obj_07 obj_08 obj_01)
   added: (pred_3 obj_08 obj_10) (pred_4 obj_07 obj_01)
   goals met: 2 of 3
8. (op_2 obj_09 obj_05 obj_13 obj_03)
   deleted: (pred_1 obj_09 obj_05 obj_03)
   added: (pred_3 obj_05 obj_13) (pred_4 obj_09 obj_03)
   goals met: 3 of 3
